Revit 2027 API
XYZ.BasisY Property
The basis of the Y axis.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static XYZ BasisY { get; }
Public Shared ReadOnly Property BasisY As XYZ
	Get
public:
static property XYZ^ BasisY {
	XYZ^ get ();
}
static member BasisY : XYZ with get
Property Value
XYZ
Remarks
The basis of the Y axis is the vector (0,1,0), the unit vector on the Y axis.
See Also
Reference
XYZ Class
Autodesk.Revit.DB Namespace